       IDENTIFICATION DIVISION.
       PROGRAM-ID. queue-simulation.

       DATA DIVISION. 
       WORKING-STORAGE SECTION.
       01 CURRENT-TIME             PIC 9(5) VALUE 0.
       01 NEXT-ARRIVAL-TIME        PIC 9(5) VALUE 0.
       01 NEXT-DEPARTURE-TIME      PIC 9(5) VALUE 99999.
       01 NEXT-SERVICE-TIME        PIC 9(3) VALUE 0.
       01 SERVICE-BAY-BUSY         PIC X VALUE "N".
       01 TOTAL-CUSTOMERS          PIC 9(5) VALUE 0.
       01 TOTAL-SERVICE-TIME       PIC 9(10)V9(2) VALUE 0.
       01 AVERAGE-SERVICE-TIME     PIC 9(10)V9(2) VALUE 0.
       01 QUEUE-LENGTH             PIC 9(5) VALUE 0.
       01 AVERAGE-QUEUE-LENGTH     PIC 9(5)V9(2) VALUE 0.
       01 WAITING-QUEUE            OCCURS 100 TIMES.
           05 CUSTOMER-ARRIVAL-TIME   PIC 9(5).
       01 SEED                     PIC 9(9) VALUE 123456789.
       01 I                        PIC 9(5).
       01 ARRIVAL-TIME             PIC 9(5).
       01 SERVICE-TIME             PIC 9(10)V9(2).
       01 RAND-NUM                 PIC 9(5).
       01 CURRENT-DATE-TIME        PIC X(8).

       PROCEDURE DIVISION.
       START-SIMULATION.
           PERFORM INITIALIZE-SEED.
           PERFORM INTIALIZE-VARIABLES.

           PERFORM UNTIL TOTAL-CUSTOMERS >= 100
              PERFORM ADVANCE-TIME-TO-NEXT-EVENT
              IF CURRENT-TIME = NEXT-ARRIVAL-TIME
                 PERFORM HANDLE-ARRIVAL
              ELSE 
                 PERFORM HANDLE-DEPARTURE
               END-IF
           END-PERFORM.

           PERFORM OUTPUT-RESULTS.

           STOP RUN.
       
       INITIALIZE-SEED.
           ACCEPT CURRENT-DATE-TIME FROM TIME.
           MOVE CURRENT-DATE-TIME TO SEED.
       
       INTIALIZE-VARIABLES.
           MOVE 0 TO CURRENT-TIME.
           MOVE 0 TO TOTAL-CUSTOMERS.
           MOVE 0 TO TOTAL-SERVICE-TIME.
           MOVE 0 TO QUEUE-LENGTH.
           PERFORM GENERATE-NEXT-ARRIVAL.
       
       ADVANCE-TIME-TO-NEXT-EVENT.
           IF NEXT-ARRIVAL-TIME < NEXT-DEPARTURE-TIME
              MOVE NEXT-ARRIVAL-TIME TO CURRENT-TIME
           ELSE
              MOVE NEXT-DEPARTURE-TIME TO CURRENT-TIME
           END-IF.

       GENERATE-RANDOM-NUMBER.
           COMPUTE SEED = (SEED * 1103515245 + 12345) - 
              (SEED * 1103515245 + 12345)/214483648.
           COMPUTE RAND-NUM = (SEED - SEED / 100 * 100) + 1.    
       
       GENERATE-NEXT-ARRIVAL.
           PERFORM GENERATE-RANDOM-NUMBER.
           COMPUTE NEXT-ARRIVAL-TIME = CURRENT-TIME + 
              (RAND-NUM * 120/100). 

       GENERATE-SERVICE-TIME.
           PERFORM GENERATE-RANDOM-NUMBER.
           COMPUTE NEXT-SERVICE-TIME = (RAND-NUM * 76/100) + 15.

       HANDLE-ARRIVAL.
           ADD 1 TO TOTAL-CUSTOMERS.
           IF QUEUE-LENGTH < 100
              MOVE CURRENT-TIME TO WAITING-QUEUE(QUEUE-LENGTH + 1)
              ADD 1 TO QUEUE-LENGTH
              IF SERVICE-BAY-BUSY = "N"
                 PERFORM START-SERVICE
              END-IF
           ELSE  
              DISPLAY "QUEUE OVERFLOW ERROR."
           END-IF
           PERFORM GENERATE-NEXT-ARRIVAL.
       
       START-SERVICE.
           MOVE "Y" TO SERVICE-BAY-BUSY.
           PERFORM GENERATE-SERVICE-TIME.
           COMPUTE NEXT-DEPARTURE-TIME = 
              CURRENT-TIME + NEXT-SERVICE-TIME.
       
       HANDLE-DEPARTURE.
           IF QUEUE-LENGTH > 0
              MOVE WAITING-QUEUE(1) TO ARRIVAL-TIME
              COMPUTE SERVICE-TIME = CURRENT-TIME - ARRIVAL-TIME
              ADD SERVICE-TIME TO TOTAL-SERVICE-TIME
              SUBTRACT 1 FROM QUEUE-LENGTH
              PERFORM MOVE-QUEUE-FORWARD
              PERFORM START-SERVICE
           ELSE
              MOVE "N" TO SERVICE-BAY-BUSY
              MOVE 99999 TO NEXT-DEPARTURE-TIME
           END-IF.

       MOVE-QUEUE-FORWARD.
           IF QUEUE-LENGTH > 0
              PERFORM VARYING I FROM 1 BY 1 UNTIL I > QUEUE-LENGTH
                 MOVE WAITING-QUEUE(I + 1) TO WAITING-QUEUE(I)
              END-PERFORM
           END-IF.
       
       OUTPUT-RESULTS.
           DISPLAY "TOTAL CUSTOMERS: " TOTAL-CUSTOMERS.
           IF TOTAL-CUSTOMERS > 0
              COMPUTE AVERAGE-SERVICE-TIME = 
                 TOTAL-SERVICE-TIME / TOTAL-CUSTOMERS
              DISPLAY "AVERAGE SERVICE TIME: " AVERAGE-SERVICE-TIME
              COMPUTE AVERAGE-QUEUE-LENGTH =
                 QUEUE-LENGTH / TOTAL-CUSTOMERS
              DISPLAY "AVERAGE QUEUE LENGTH: " AVERAGE-QUEUE-LENGTH
           ELSE 
              DISPLAY "NO CUSTOMERS PROCESSED."
           END-IF.


       

